<?php

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'الفواتير',
            'قائمة الفواتير',
            'الفواتير المدفوعه',
            'الفواتير المدفوعه جزئيا',
            'الفواتير الغير مدفوعه',
            'ارشيف الفواتير',
            'التقارير',
            'تقرير الفواتير',
            'تقرير العملاء',
            'المستخدمين',
            'قائمة المستخدمين',
            'صلاحيات المستخدمين',
            'الاعدادات',
            'المنتجات',
            'الاقسام',


            'اضافة فاتوره',
            'حذف الفاتوره',
            'تصدير EXCEL',
            'تغير حالة الدفع',
            'تعديل الفاتوره',
            'اضافة مرفق',
            'حذف المرفق',
            'طباعة فاتوره',

            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            'عرض صلاحية',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            'اضافة لعبه',
            'تعديل لعبه',
            'حذف لعبه',

            'اضافة مدرب',
            'تعديل مدرب',
            'حذف مدرب',
            'الاشعارات',
            'الايقونات',
            'الرسائل',
            'الالعاب',
            'الرئيسيه',
            'المستخدمين',
            'التفاصيل',
            'المدربين',
            'اخري',


        ];
        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
